# üñºÔ∏è Pandas DataFrame

**Pandas DataFrame** is a 2-dimensional labeled data structure with columns of potentially different types.  
It is one of the core data structures in Pandas and is widely used in data manipulation and analysis.

#### ¬ª Import the Pandas library, usually abbreviated as `pd`

In [1]:
import pandas as pd

#### ¬ª Create a list of values

In [2]:
lis = [1,5,3,0,9]
lis

[1, 5, 3, 0, 9]

#### ¬ª Convert list into a DataFrame with a column name

In [3]:
pd.DataFrame(lis, columns=["var_name"])

   var_name
0         1
1         5
2         3
3         0
4         9

#### ¬ª Import the Numpy library, usually abbreviated as `np`

In [4]:
import numpy as np

#### ¬ª Create a NumPy array with a shape

In [5]:
a = np.arange(9).reshape((3,3))
a

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

#### ¬ª Convert NumPy array into DataFrame with column names

In [6]:
df = pd.DataFrame(a, columns=["var1", "var2","var3"])
df

   var1  var2  var3
0     0     1     2
1     3     4     5
2     6     7     8

#### ¬ª View the first few elements -> `dataframe.head()`

In [7]:
df.head()

   var1  var2  var3
0     0     1     2
1     3     4     5
2     6     7     8

#### ¬ª View the first n elements -> `dataframe.head(n)`

In [32]:
df.head(2)

   var1  var2  var3
0     0     1     2
1     3     4     5

#### ¬ª View the last few elements -> `dataframe.tail()`

In [24]:
df.tail()

   var0  var1  var2
0     0     1     2
1     3     4     5
2     6     7     8

#### ¬ª View the last n elements -> `dataframe.tail[n]`

In [25]:
df.tail(1)

   var0  var1  var2
2     6     7     8

#### ¬ª Get column labels of the DataFrame

In [33]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

#### ¬ª Rename all columns

In [8]:
df.columns = ("var0", "var1", "var2")
df

   var0  var1  var2
0     0     1     2
1     3     4     5
2     6     7     8

#### ¬ª Check the type of dataframe

In [9]:
type(df)

pandas.core.frame.DataFrame

#### ¬ª Get row and column index objects of dataframe

In [10]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var0', 'var1', 'var2'], dtype='object')]

#### ¬ª Get the number of rows and columns

In [11]:
df.shape

(3, 3)

#### ¬ª Get total number of elements (rows * columns)

In [12]:
df.size

9

#### ¬ª Get number of dimensions of the DataFrame

In [21]:
df.ndim

2

#### ¬ª Get the underlying NumPy array of the DataFrame

In [22]:
df.values

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])